app/controllers/photos_controller.rb

  def create
    Photo.create(photo_params)
---
INSERT INTO "photos" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"